app/controllers/artists_controller.rb

  def index
    if params[:artist_id]
    @songs = Artist.find(params[:artist_id].songs)
  else
    @artists = Artist.all
---
SELECT "artists".* FROM "artists"